In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [2]:
df = DataFrame({'k1':['X','X','Y','Y','Z'],
                    'k2':['alpha','beta','alpha','beta','alpha'],
                    'dataset1':np.random.randn(5),
                    'dataset2':np.random.randn(5)},columns=['k1','k2','dataset1','dataset2'])

In [3]:
df

  k1     k2  dataset1  dataset2
0  X  alpha  0.011262 -0.290774
1  X   beta  0.970832 -0.326522
2  Y  alpha -0.652800 -1.023557
3  Y   beta  0.112837 -2.513551
4  Z  alpha -2.115974 -0.417714

In [4]:
# Grab the dataset1 column and group it by the k1 key
group1 = df['dataset1'].groupby(df['k1'])

In [6]:
print(group1)

<pandas.core.groupby.SeriesGroupBy object at 0x0000025D907FA438>

In [7]:
for g in group1:
    
    print(g[0],g[1])

X 0    0.011262
1    0.970832
Name: dataset1, dtype: float64
Y 2   -0.652800
3    0.112837
Name: dataset1, dtype: float64
Z 4   -2.115974
Name: dataset1, dtype: float64

In [6]:
# Perform average on group1
group1.mean()

k1
X    0.128248
Y   -0.445335
Z    1.319512
Name: dataset1, dtype: float64

In [7]:
#We'll make some arrays and use them as keys
cities = np.array(['NY','LA','LA','NY','NY'])
month = np.array(['Oct','Jun','Jan','Feb','Sep'])

In [8]:
# Use the data from dataset1, group the means by city and month
df['dataset1'].groupby([cities,month]).mean()

LA  Jan   -0.106174
    Jun    1.193065
NY  Feb   -0.784496
    Oct   -0.936568
    Sep    1.319512
Name: dataset1, dtype: float64

In [9]:
# Pass column names as group keys, will return values that could be calculated
df.groupby('k1').mean()

    dataset1  dataset2
k1
X   0.128248  0.325110
Y  -0.445335  0.920529
Z   1.319512  1.068557

In [10]:
# Or multiple column names
df.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha -0.936568 -0.251131
   beta   1.193065  0.901351
Y  alpha -0.106174 -0.402509
   beta  -0.784496  2.243567
Z  alpha  1.319512  1.068557

In [11]:
# Another useful groupby method is getting the group sizes
df.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [8]:
# We can also iterate over groups
for group_name,group in df.groupby('k1'):
    print ("This is the %s group" %group_name)
    print (group)
    print ('\n')

This is the X group
  k1     k2  dataset1  dataset2
0  X  alpha  0.011262 -0.290774
1  X   beta  0.970832 -0.326522


This is the Y group
  k1     k2  dataset1  dataset2
2  Y  alpha -0.652800 -1.023557
3  Y   beta  0.112837 -2.513551


This is the Z group
  k1     k2  dataset1  dataset2
4  Z  alpha -2.115974 -0.417714

In [9]:
df

  k1     k2  dataset1  dataset2
0  X  alpha  0.011262 -0.290774
1  X   beta  0.970832 -0.326522
2  Y  alpha -0.652800 -1.023557
3  Y   beta  0.112837 -2.513551
4  Z  alpha -2.115974 -0.417714

In [13]:
# We can also iterate with multiple keys
for (k1,k2) , group in df.groupby(['k1','k2']):
    print ("Key1 = %s Key2 = %s" %(k1,k2))
    print (group)
    print ('\n')

Key1 = X Key2 = alpha
  k1     k2  dataset1  dataset2
0  X  alpha -0.936568 -0.251131


Key1 = X Key2 = beta
  k1    k2  dataset1  dataset2
1  X  beta  1.193065  0.901351


Key1 = Y Key2 = alpha
  k1     k2  dataset1  dataset2
2  Y  alpha -0.106174 -0.402509


Key1 = Y Key2 = beta
  k1    k2  dataset1  dataset2
3  Y  beta -0.784496  2.243567


Key1 = Z Key2 = alpha
  k1     k2  dataset1  dataset2
4  Z  alpha  1.319512  1.068557

In [14]:
df

  k1     k2  dataset1  dataset2
0  X  alpha -0.936568 -0.251131
1  X   beta  1.193065  0.901351
2  Y  alpha -0.106174 -0.402509
3  Y   beta -0.784496  2.243567
4  Z  alpha  1.319512  1.068557

In [11]:
list(df.groupby('k1'))

[('X',   k1     k2  dataset1  dataset2
  0  X  alpha  0.011262 -0.290774
  1  X   beta  0.970832 -0.326522), ('Y',   k1     k2  dataset1  dataset2
  2  Y  alpha -0.652800 -1.023557
  3  Y   beta  0.112837 -2.513551), ('Z',   k1     k2  dataset1  dataset2
  4  Z  alpha -2.115974 -0.417714)]

In [14]:
group_dict['Z']

  k1     k2  dataset1  dataset2
4  Z  alpha -2.115974 -0.417714

In [16]:
# A possibly useful tactic is creating a dictionary of the data pieces 
group_dict = dict(list(df.groupby('k1')))

#Show the group with X
group_dict['X']

  k1     k2  dataset1  dataset2
0  X  alpha  0.011262 -0.290774
1  X   beta  0.970832 -0.326522

In [21]:
group_dict

{'X':   k1     k2  dataset1  dataset2
 0  X  alpha -0.937095  1.375380
 1  X   beta -0.149980  0.161664, 'Y':   k1     k2  dataset1  dataset2
 2  Y  alpha  0.278685  0.488323
 3  Y   beta -0.227667  0.145129, 'Z':   k1     k2  dataset1  dataset2
 4  Z  alpha  0.542489   0.54153}

In [23]:
# We could have also chosen to do this with axis = 1
group_dict_axis1 = dict(list(df.groupby(df.dtypes,axis=1)))

In [24]:
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0 -0.936568 -0.251131
 1  1.193065  0.901351
 2 -0.106174 -0.402509
 3 -0.784496  2.243567
 4  1.319512  1.068557, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [15]:
# Group the dataset2 column with both sets of keys
dataset2_group = df.groupby(['k1','k2'])[['dataset2']]

dataset2_group.mean()

          dataset2
k1 k2
X  alpha -0.290774
   beta  -0.326522
Y  alpha -1.023557
   beta  -2.513551
Z  alpha -0.417714